tap "omnisharp/omnisharp-roslyn"
tap "onevcat/tap"
tap "xo/xo", trusted: { formulae: ["usql"] }
# Shell extension to jump to frequently used directories
brew "autojump"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Top-like interface for container metrics
brew "ctop"
# Database client every command-line junkie deserves
brew "dblab"
# Utility to configure multi-display resolutions and arrangements
brew "displayplacer"
# Tool for exploring each layer in a docker image
brew "dive"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Command-line tool to show clear git graphs arranged for your branching model
brew "git-graph"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Render markdown on the CLI
brew "glow"
# Command-driven, interactive function plotting
brew "gnuplot"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# Easy, fast, and beautiful database client for the terminal
brew "harlequin"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Intelligent Kotlin support for any editor/IDE using the Language Server Protocol
brew "kotlin-language-server"
# Kafka TUI client
brew "ktea"
# Simple terminal UI for git commands
brew "lazygit"
# Cross-platform TUI database management tool
brew "lazysql"
# CLI for SQLite Databases with auto-completion and syntax highlighting
brew "litecli"
# Language Server Protocol for Markdown
brew "marksman"
# NCurses Disk Usage
brew "ncdu"
# Interactive GPU process monitor
brew "nvtop"
# Development kit for the Java programming language
brew "openjdk@17"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# QR Code generation
brew "qrencode"
# Database management TUI for PostgreSQL/MySQL/SQLite
brew "rainfrog"
# File browser
brew "ranger"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Sparklines for the shell
brew "spark"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Command-line tool that draw plots on the terminal
brew "youplot"
# TUI for exploring data in a Kafka cluster
brew "yozefu"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Android SDK component
cask "android-platform-tools"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Window peeking utility app
cask "dockdoor"
cask "font-meslo-lg-nerd-font"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Replacement for Docker Desktop
cask "orbstack"
# Coding agent orchestrator
cask "onevcat/tap/prowl"
# Open-source code editor
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "ahinkle.laravel-model-snippets"
vscode "alefragnani.bookmarks"
vscode "alexisvt.flutter-snippets"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "anthropic.claude-code"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "christian-kohler.path-intellisense"
vscode "codingyu.laravel-goto-view"
vscode "dadroit.dadroit-json-generator"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dinhani.copy-on-select"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "kevinrose.vsc-python-indent"
vscode "lamarcke.kanagawa-black"
vscode "maptz.regionfolder"
vscode "mehedidracula.php-namespace-resolver"
vscode "mhutchie.git-graph"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-zh-hant"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel5-snippets"
vscode "pranaygp.vscode-css-peek"
vscode "qufiwefefwoyn.kanagawa"
vscode "ryannaddy.laravel-artisan"
vscode "tushortz.python-extended-snippets"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-gradle"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "wallabyjs.quokka-vscode"
vscode "wholroyd.jinja"
vscode "xdebug.php-debug"
vscode "zhuangtongfa.material-theme"
go "github.com/tarrragon/cc-statusline"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/xo/usql"
uv "-"
uv "doc-system"
uv "mermaid-ascii"
uv "project-init"
uv "skill-sync"
uv "ticket-system"
uv "version-release"
uv "worktree-skill"
npm "@colbymchenry/codegraph"
npm "@vtsls/language-server"
npm "corepack"
npm "ctx7"
npm "intelephense"
npm "markdownlint-cli"
npm "typescript"
npm "vscode-langservers-extracted"
npm "yaml-language-server"
