# VS Code + 擴充 — optional editor 群組的一整包。
# 由 scripts/install-optional.sh 選 editor 時跑 `brew bundle --file=packages/Brewfile.editor`。
# 用 brew bundle 是因為它原生支援 vscode "..." 條目（`code --install-extension` 的包裝）。
# 從核心 Brewfile 搬出：VS Code 是選配編輯器（有人用 Cursor / Neovim），擴充跟著它走。

cask "visual-studio-code"

vscode "aaron-bond.better-comments"
vscode "ahinkle.laravel-model-snippets"
vscode "alefragnani.bookmarks"
vscode "alexisvt.flutter-snippets"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "anthropic.claude-code"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "christian-kohler.path-intellisense"
vscode "codingyu.laravel-goto-view"
vscode "dadroit.dadroit-json-generator"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dinhani.copy-on-select"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "kevinrose.vsc-python-indent"
vscode "lamarcke.kanagawa-black"
vscode "maptz.regionfolder"
vscode "mehedidracula.php-namespace-resolver"
vscode "mhutchie.git-graph"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-zh-hant"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel5-snippets"
vscode "pranaygp.vscode-css-peek"
vscode "qufiwefefwoyn.kanagawa"
vscode "ryannaddy.laravel-artisan"
vscode "tushortz.python-extended-snippets"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-gradle"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "wallabyjs.quokka-vscode"
vscode "wholroyd.jinja"
vscode "xdebug.php-debug"
vscode "zhuangtongfa.material-theme"
